<a href="https://colab.research.google.com/github/SainiManisha/basics-ip/blob/master/SQLITE_class_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import sqlite3

In [2]:
import pandas as pd

In [3]:
df=pd.DataFrame({'Col':[1,2,3]})

In [4]:
print(df)

   Col
0    1
1    2
2    3

In [5]:
df

   Col
0    1
1    2
2    3

In [6]:
import sqlite3, os
import pandas as pd
df=pd.DataFrame({'Col':[1,2,3]})
df

   Col
0    1
1    2
2    3

In [7]:
conn= sqlite3.connect('example_try.db')

In [8]:
df.to_sql('table2',conn)

In [9]:
sql= 'select * from table2'

In [10]:
pd.read_sql(sql, conn)

   index  Col
0      0    1
1      1    2
2      2    3